/******************************************************************************

                  版权所有 (C), 2001-2011, 华为技术有限公司

 ******************************************************************************
  文 件 名   : OmDrvInterface.h
  版 本 号   : 初稿
  生成日期   : 2008年6月9日
  最近修改   :
  功能描述   : OmDrvInterface.h 的头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2008年6月9日
    修改内容   : 创建文件

******************************************************************************/

#ifndef __OMDRVINTERFACE_H__
#define __OMDRVINTERFACE_H__

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif


/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include  "vos.h"
#include  "DrvInterface.h"

#pragma pack(4)

/*****************************************************************************
  2 宏定义
*****************************************************************************/
#define OM_MAX_MEMORY_ADDR_CNT      8
/*Query PA attribute*/
enum
{
    OM_W_PA_TEMP = 1,
    OM_G_PA_TEMP,
    OM_W_PLL_LOCK,
    OM_G_PLL_LOCK,
    OM_W_HKADC,
    OM_G_HKADC,
    OM_W_BBP_PLL_LOCK,
    OM_G_BBP_PLL_LOCK,
    OM_DSP_PLL_LOCK,
    OM_ARM_PLL_LOCK,
    OM_SIM_TEMP,
    OM_TCM_STATUS,
    OM_SDMMC_STATUS,
    OM_BATTER_VOLT,
    OM_BATTER_TEMP,
    OM_OLED_TEMP,
};
/*****************************************************************************
  3 枚举定义
*****************************************************************************/
/*硬件类型*/
typedef enum
{
    ID_OM_PMU_STATUS = 1,
    ID_OM_ABB_STATUS,
    ID_OM_SPI_STATUS,
    ID_OM_I2C_STATUS,
    ID_OM_SIC_STATUS,
    ID_OM_BUTT
}OM_HARDWARE_STATUS_ENUM;
/*****************************************************************************
  4 全局变量声明
*****************************************************************************/


/*****************************************************************************
  5 消息头定义
*****************************************************************************/


/*****************************************************************************
  6 消息定义
*****************************************************************************/


/*****************************************************************************
  7 STRUCT定义
*****************************************************************************/

 typedef struct
{
    VOS_UINT32  ulCnt;
    VOS_UINT32  aulAddr[OM_MAX_MEMORY_ADDR_CNT];
}OM_QUERY_MEMORY_STRU;

 typedef struct
{
    VOS_UINT16  usEfId;         /* 要读取的文件的ID */
    VOS_UINT8   ucRecordNum;    /* 文件的记录号     */
    VOS_UINT8   ucRsv;
}OM_QUERY_USIMM_STRU;

 typedef struct
{
    VOS_UINT16  usEfId;         /* 要读取的文件的ID */
    VOS_UINT8   ucRecordNum;    /* 文件的记录号     */
    VOS_UINT8   ucEfLen;        /* 文件记录的长度   */
    VOS_UINT8   aucEf[4];       /* 文件的内容       */
}OM_CONFIG_USIMM_STRU;

/*****************************************************************************
  8 UNION定义
*****************************************************************************/


/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/


/*****************************************************************************
  10 函数声明
*****************************************************************************/


#if ((VOS_OS_VER == VOS_WIN32) || (VOS_OS_VER == VOS_NUCLEUS))
#pragma pack()
#else
#pragma pack(0)
#endif




#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif /* end of OmDrvInterface.h */

